// const name = prompt("Як тебе звати?");
// <<4.1DZ
// alert(`Приємно познайомитись ${name}, а мене звати Владислав`);

// ===========================================================================================================

// let num1 = Number(prompt("Введіть Ваше перше число:"));
// let num2 = Number(prompt("Введіть Ваше друге число:"));
// let num3 = Number(prompt("Введіть Ваше третє число:"));
                                                                            // <<4.2DZ
// if (num1 === num2 && num2 === num3) {
//   alert("Ваші всі цифри однакові!");
// } else if (num1 === num2 || num2 === num3 || num1 === num3) {
//   alert("У Вас два однакових числа!");
// } else {
//   alert("У Вас всі числа різні!");
// }

// ==================================================================================================================
