// const name = prompt("Як тебе звати?");
//                                                                                     <<4.1DZ
// alert(`Приємно познайомитись ${name}, а мене звати Владислав`);

// ===========================================================================================================

// let num1 = Number(prompt("Введіть Ваше перше число:"));
// let num2 = Number(prompt("Введіть Ваше друге число:"));
// let num3 = Number(prompt("Введіть Ваше третє число:"));
//                                                                                       <<4.2DZ
// if (num1 === num2 && num2 === num3) {
//   alert("Ваші всі цифри однакові!");
// } else if (num1 === num2 || num2 === num3 || num1 === num3) {
//   alert("У Вас два однакових числа!");
// } else {
//   alert("У Вас всі числа різні!");
// }

// ==================================================================================================================

// let year = Number(prompt("Введіть рік вашого народження"));
// if (year === 0) {
//   alert("Шкода що Ви не захотіли вводити ваш рік народження");
// }

// let city = prompt("Введіть місто в якому ви проживаєте");
// if (city === null) {
//   alert("Шкода що Ви не захотіли вводити ваше місто");
// }
// if (year === 0 && city === null) {
//   alert("Шкода, але я про тебе нічого не знаю :(");
// } else if (year === 0 || city === null) {
//   alert("Шкода, але для продовження потрібно ввести всі данні :(");
// } else {                                                                                            <<4.3DZ
//   if (city.toLowerCase() === "київ" && year !== 0) {
//     alert(
//       `Ого тобі ${2026 - year} років, і ти проживаєш в столиці України, ${city}`,
//     );
//   } else if (city.toLowerCase() === "вашингтон" && year !== 0) {
//     alert(
//       `Ого тобі ${2026 - year} років, і ти проживаєш в столиці Америки, ${city}`,
//     );
//   } else if (city.toLowerCase() === "лондон" && year !== 0) {
//     alert(
//       `Ого тобі ${2026 - year} років, і ти проживаєш в столиці Великобританії, ${city}`,
//     );
//   } else {
//     alert(`Ого тобі ${2026 - year} років, і ти проживаєш у місті ${city}`);
//   }
// }

// let sport = prompt("Вкажи свій улюблений вид спорту");

// if (sport.toLowerCase() === "футбол") {
//   alert(`Ого, ти хочеш стати як Кріштіану Роналду`);
// } else if (sport.toLowerCase() === "волейбол") {
//   alert(`Ого, ти хочеш стати як Олег Плотницький`);
// } else if (sport.toLowerCase() === "теніс") {
//   alert(`Ого, ти хочеш стати як Віталій Сачко`);
// } else {
//   alert("Це дуже круто");
// }

// ==========================================================================================

// let numOrStr = prompt("input number or string");
// console.log(numOrStr);

// switch (true) {
//   case numOrStr === null:
//     console.log("Ви нажали скасувати");
//     break;                                                                                   <<4.4DZ
//   case numOrStr.trim() === "":
//     console.log("Empty String");
//     break;
//   case isNaN(+numOrStr):
//     console.log(" number is Ba_NaN");
//     break;
//   default:
//     console.log("OK!");
// }
